RU: dict[str, str] = {
    "greeating_at_the_start": "<b>Привет! Вы попали в мой бот с полезностями - "
                              "рада, что заглянули.</b>\n\n"
                              "<b>Меня зовут Виктория Изория</b> - я стилист, "
                              "парикмахер, преподаватель с опытом более 20 лет\n\n"
                              "<blockquote>Учу мастеров видеть форму, а не копировать Reels</blockquote>\n\n"
                              "<b>Внутри бота - много всего, что помогает "
                              "стать увереннее.</b>\n\n"
                              "✂️ Разборы типичных ошибок\n"
                              "📐 Как научиться чувствовать форму и\n"
                              "работать в потоке\n"
                              "🎨 Нюансы в колористике\n"
                              "💬 Размышления о профессии, страхах, "
                              "росте и людях\n"
                              "📚 Истории учеников, которые начинали с "
                              "нуля - и выросли до собственного салона "
                              "или стиля преподавания.\n\n"
                              "<b>Присоединяйся!</b>",
    "subscribe_to_the_channel": "🔘 Подписаться на канал",
    "already_signed": "🔘 Уже подписан",
    "subscription_check": "Подождите немного, проверяю подписку на "
                          "мой канал.",
    "signed_to_the_channel": "❤️ <b>Вижу твою подписку</b>\n\n"
                             "<b>Жми на «☰ Меню» и выбери с чего хочешь начать:</b>\n\n"
                             "Пройти тест, получить бесплатный урок, "
                             "узнать о моем курсе или что-то еще\n\n"
                             "Ты можешь возвращаться сюда в любой "
                             "момент - все всегда под рукой ✂️\n\n"
                             "💬 <b>Кстати, я буду регулярно добавлять в "
                             "бот новые материалы, техники и размышления. "
                             "Так что не отписывайся - впереди много "
                             "полезного!</b>",
    "not_signed_to_the_channel": "<b>Ой, я не вижу твою подписку!</b>😥\n\n"
                                 "Подпишись на канал, чтобы получить\n"
                                 "материал.\n\n"
                                 "Для меня важен энергообмен, да и думаю\n"
                                 "мой канал будет очень полезен для тебя,\n"
                                 "ведь я щедро делюсь многими\n"
                                 "инструментами из своей реальной практики.",
    "bad_request": "⚠️ Произошла ошибка при проверке подписки."
}
RU_MAIN_MENU: dict[str, str] = {
    "/free_lesson": "🎁 Бесплатный урок: <b>«Форма»</b>\n\n"
                    "<blockquote>«Я вроде делаю все правильно - а форма не "
                        "садится»\n"
                        "«На видео красиво. А у меня в жизни не так»</blockquote>\n\n"
                        "<b>Знакомо?</b>\n\n"
                        "В этом уроке я показала, почему так "
                        "происходит - и с чего начать, чтобы наконец понять "
                        "форму, а не просто повторять за другими.",
    "see_the_video": "🎬 Смотреть на YouTube",
    "/benefit": "📌 <b>Собрала полезные материалы в одном "
               "месте</b>\n\n"
               "Здесь - все, что может реально пригодиться "
               "в работе: только то, что сама применяю и "
               "даю ученикам.\n\n"
               "<b>👇 Вот, что уже доступно</b>\n\n"
               "<a href='https://youtu.be/cez68l66JjA'>🎁 Бесплатный урок «Форма»</a>\n\n"
               "<a href='https://telegra.ph/5-oshibok-kotorye-sovershayut-pochti-vse-mastera-v-nachale-06-22'>📄 Статья: Разбор 5 частых ошибок</a>\n\n"
               "<a href='https://telegra.ph/2-post-06-22'>📄 Статья: Почему ты все умеешь - но все еще не уверена</a>\n\n"
               "<a href='https://telegra.ph/VSE-HOTYAT-KAK-VSE--I-TY-UZHE-NE-MOZHESH-06-22'>📄 Статья: Все хотят одно и то же. А я больше не могу</a>\n\n"
               "<a href='https://t.me/viktoriya_izoriya/14'>🎧 Подкаст: Когда страшно</a>\n\n"
               "<a href='https://t.me/izoriachat/17'>🎧 Подкаст: От хаоса к системе</a>\n\n"
               "<a href='https://t.me/izoriachat/18'>🎧 Подкаст: Как сказать «я так не делаю» - и не потерять клиента</a>\n\n"
               "<a href='https://youtu.be/TwrMGV_HZos?si=L9rZYq1E_GOo3AdY'>📹 5 причин, почему у тебя не садится форма</a>\n\n"
               "🔁 <b>Этот список я обновляю. Можно сохранять и возвращаться, "
               "когда нужно</b>\n\n"
               "❤️ <b>Делись с коллегами - пригодится.</b>",
    "/kurs": "Сейчас я создаю онлайн-продукт, который "
             "поможет тебе научиться видеть форму.\n\n"
             "💡 <b>Хочешь, я пришлю тебе приглашение "
             "одной из первых, когда все будет готово?</b>",
    "yes_want_kurs": "🔘 Да",
    "no_want_kurs": "🔘 Пока просто читаю",
    "i_want_to_get": "<b>Чтобы получить приглашение одной из "
                     "первых - оставь свои данные в короткой "
                     "анкете</b> 👇🏻\n\n🕓 Это займет 1-2 минуты.\n\n"
                     "💬 Запись ни к чему не обязывает - "
                     "просто дает тебе ранний доступ и "
                     "полезные материалы до запуска.",
    "open_anket": "Открыть анкету предзаписи",
    "i_just_think": "<b>Понимаю. Иногда нужно время, чтобы "
                    "присмотреться</b>☺️\n\n"
                    "Если захочешь пойти глубже - я рядом.\n\n"
                    "<b>А пока загляни в «☰ Меню», "
                    "там есть бесплатный урок, "
                    "и еще больше пользы.</b>",
    "/help": "<b>Нужна помощь? Я рядом.</b>\n\n"
             "Если что-то не работает, урок не открылся "
             "или остались вопросы - пиши в поддержку\n"
             "👉 @izoriya_support",
    "/policy": "Политика кофиденциальности",
    "policy_conf": "Политика обработки персональных данных"
}
COMMANDS_MENU: dict[str, str] = {
    "/test": "ТЕСТ: Какой ты мастер?",
    "/free": "Бесплатный урок форма",
    "/use": "Польза",
    "/kurs": "Узнать о курсе",
    "/start": "Перезапустить бота",
    "/help": "Помощь",
    "/admin_panel": "админ-панель",
}
ADMIN_MENU: dict[str, str] = {
    "statistic": "📊 Статистика",
    "sending": "📨 Рассылка",
    "leave_the_admin_panel": "🔙 Выйти из админ-панели",
    "hello_admin": "👑 Добро пожаловать в админ-панель.\n"
                   "Выберите действие:",
    "stats": "В боте зарегистрировано:",
    "sending_text": "✏️ Введите текст рассылки",
    "exit": "🚪 Вы вышли из админ-панели",
}
OTHER_USER_MESSAGE: dict[str, str] = {
    "not_admin_user": "❌ Вы не являетесь администратором, "
                       "данная команда вам не доступна.\n\n"
                       "Выберите другую команду.",
    "unknown_commands": "Я не распознаю эту команду.\n"
                        "Можете выбрать доступные команды "
                        "из Меню ☰",
    "unknown_text": "<b>Это очень здорово, что ты умеешь писать, "
                    "но отвечать на это мне не разрешено</b>🤫\n\n"
                    "Давай ты просто выберешь команду из «☰ Меню» 🤗",
    "handle_photo": "📸 Отличное фото! Спасибо!",
    "handle_document": "📄 Документ получен!",
    "handle_sticker": "🎉 Классный стикер"
}